qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_bus.h
/** @defgroup BUS_LL_EF_AHB1_GRP1 AHB1 GRP1
  * @{
  */

/**
  * @brief  Enable AHB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SDIO
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ESMC
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB1ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB1ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SDIO
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ESMC
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB1ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FMC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SDIO
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ESMC
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1ENR, Periphs);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SDIO
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ESMC
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB1RSTR, Periphs);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_DMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SDIO
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ESMC
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB1RSTR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_AHB2_GRP1 AHB2 GRP1
  * @{
  */

/**
  * @brief  Enable AHB2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->AHB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->AHB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->AHB2ENR, Periphs) == Periphs) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB2 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2ENR, Periphs);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL  
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->AHB2RSTR, Periphs);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL  
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_AHB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->AHB2RSTR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB1_GRP1 APB1 GRP1
  * @{
  */

/**
  * @brief  Enable APB1 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN   
  *         @arg @ref LL_APB1_GRP1_PERIPH_BKP   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CTC   
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 GRP1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN   
  *         @arg @ref LL_APB1_GRP1_PERIPH_BKP   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CTC   
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB1ENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN   
  *         @arg @ref LL_APB1_GRP1_PERIPH_BKP   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CTC   
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1ENR, Periphs);
}

/**
  * @brief  Force APB1 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CTC   
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB1RSTR, Periphs);
}

/**
  * @brief  Release APB1 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL   
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7  
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM13 
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM14 
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1  
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2  
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CAN   
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR   
  *         @arg @ref LL_APB1_GRP1_PERIPH_CTC   
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1RSTR, Periphs);
}
/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2_GRP1 APB2 GRP1
  * @{
  */

/**
  * @brief  Enable APB2 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 GRP1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2ENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2ENR, Periphs);
}

/**
  * @brief  Force APB2 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL   
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Release APB2 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL   
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @note (*) peripheral not available on all devices
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* RCC */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32F403_LL_BUS_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
